task/single-software-execution/cli/openfoam/task-19/init_file/porous_base/constant/transportProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
transportModel  Newtonian;
nu              [0 2 -1 0 0 0 0] 1e-06;
